first_routes/app/controllers/artwork_shares_controller.rb

    def create
        share = ArtworkShare.new(artwork_share_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 2], ["created_at", "2021-09-16 13:14:30.385883"], ["updated_at", "2021-09-16 13:14:30.385883"]]