first_routes/app/controllers/artworks_controller.rb

    def index
        if params.has_key?(:user_id)
            art = Artwork.where(artist_id: params[:user_id])
            art_shared = ArtworkShare.where(viewer_id: params[:user_id])
            art_shared.each do |ele|
                art += Artwork.where(id: ele.artwork_id)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 1]]
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 1]]
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1  [["id", 2]]

    def create
        artwork = Artwork.new(artwork_params)
        # replace the `Artwork_attributes_here` with the actual attribute keys
        if artwork.save
---
INSERT INTO "artworks" ("title", "img_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Power"], ["img_url", "www.ask.com"], ["artist_id", 10], ["created_at", "2021-09-15 21:02:16.456002"], ["updated_at", "2021-09-15 21:02:16.456002"]]