first_routes/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 12]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 7]]
---
    def index
        if params.has_key?(:user_id)
            comments = Comment.where(user_id: params[:user_id])
            render json: comments.all
        elsif params.has_key?(:artwork_id)
            comments = Comment.where(artwork_id: params[:artwork_id])
            render json: comments.all

INSERT INTO "comments" ("body", "user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "damn damn damn that's a goddamn shame"], ["user_id", 12], ["artwork_id", 7], ["created_at", "2021-09-16 14:20:39.362170"], ["updated_at", "2021-09-16 14:20:39.362170"]]
---
    def create
        comment = Comment.new(comment_params)

        if comment.save