first_routes/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username LIKE '%ugger%')
SELECT "users".* FROM "users"
---
    def index
        if params[:query]
            wildstring = params[:query]
            user = User.where('username LIKE ?', "%#{wildstring}%" )
            render json: user
        else
            render json: User.all